Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunInsideMinTreadDepthFailure Property
 Please enter a positive value less than Actual Tread Depth on Stair Path (%Actual Tread Depth%).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunInsideMinTreadDepthFailure { get; }
Public Shared ReadOnly Property WinderRunInsideMinTreadDepthFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunInsideMinTreadDepthFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunInsideMinTreadDepthFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace